openfoam2/OpenFOAM-2.3.x/tutorials/incompressible/pisoFoam/les/pitzDailyMapped/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type                mapped;
        value               uniform (10 0 0);
        interpolationScheme cell;
        setAverage          true;
        average             (10 0 0);
    }

    outlet
    {
        type                inletOutlet;
        inletValue          uniform (0 0 0);
        value               uniform (0 0 0);
    }

    upperWall
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }

    lowerWall
    {
        type                fixedValue;
        value               uniform (0 0 0);
    }

    frontAndBack
    {
        type                empty;
    }
}

// ************************************************************************* //
